* One-to-many
:PROPERTIES:
:header-args: sql :engine postgresql :dbuser nico :database one-to-many
:END:
** Write a SQL statement to add the following call data to the database:
| when                | duration | first_name | last_name |     number |
| 2016-01-18 14:47:00 |      632 | William    | Swift     | 7204890809 |

#+BEGIN_SRC sql
  INSERT INTO calls ("when", duration, contact_id)
  VALUES
    ('2016-01-18 14:47:00', 632, 6);
#+END_SRC

#+RESULTS:
| INSERT 0 1 |
|------------|
** Write a SQL statement to retrieve the call times, duration, and first name for all calls not made to William Swift.


#+BEGIN_SRC sql
  SELECT c."when", c.duration, con.first_name
    FROM calls AS c
           INNER JOIN contacts AS con
           ON c.contact_id = con.id 
   WHERE con.first_name <> 'William' AND
         con.last_name <> 'Swift';
#+END_SRC

#+RESULTS:
| when                | duration | first_name |
|---------------------+----------+------------|
| 2016-01-08 15:30:00 |      350 | Yuan       |
| 2016-01-11 11:06:00 |      111 | Tamila     |
| 2016-01-13 18:13:00 |     2521 | Tamila     |
| 2016-01-17 09:43:00 |      982 | Yuan       |
** Write SQL statements to add the following call data to the database:

| when                | duration | first_name | last_name |     number |
| 2016-01-17 11:52:00 |      175 | Merve      | Elk       | 6343511126 |
| 2016-01-18 21:22:00 |       79 | Sawa       | Fyodorov  | 6125594874 |


#+BEGIN_SRC sql
  BEGIN;
  INSERT INTO contacts (first_name, last_name, NUMBER)
  VALUES
    ('Merve', 'Elk', '6343511126'),
    ('Sawa', 'Fyodorov', 6125594872);
  WITH merve AS (
    SELECT id
      FROM contacts
     WHERE first_name = 'Merve' AND last_name = 'Elk'),
    sawa AS (
      SELECT id
        FROM contacts
       WHERE first_name = 'Sawa' AND last_name = 'Fyodorov')
  INSERT INTO calls ("when", duration, contact_id)
  VALUES
      ('2016-01-17 11:52:00', 175, (SELECT id FROM merve)),
    ('2016-01-18 21:22:00', 79, (SELECT id FROM sawa));
  COMMIT;
#+END_SRC

#+RESULTS:
| BEGIN      |
|------------|
| INSERT 0 2 |
| INSERT 0 2 |
| COMMIT     |
** check to see if records added correctly

#+BEGIN_SRC sql
  SELECT "when", ca.duration, co.first_name, co.last_name, co.NUMBER
    FROM calls AS ca
           INNER JOIN contacts AS co
               ON ca.contact_id = co.id;
#+END_SRC

#+RESULTS:
| when                | duration | first_name | last_name |     number |
|---------------------+----------+------------+-----------+------------|
| 2016-01-02 04:59:00 |     1821 | William    | Swift     | 7204890809 |
| 2016-01-08 15:30:00 |      350 | Yuan       | Ku        | 2195677796 |
| 2016-01-11 11:06:00 |      111 | Tamila     | Chichigov | 5702700921 |
| 2016-01-13 18:13:00 |     2521 | Tamila     | Chichigov | 5702700921 |
| 2016-01-17 09:43:00 |      982 | Yuan       | Ku        | 2195677796 |
| 2016-01-18 14:47:00 |      632 | William    | Swift     | 7204890809 |
| 2016-01-17 11:52:00 |      175 | Merve      | Elk       | 6343511126 |
| 2016-01-18 21:22:00 |       79 | Sawa       | Fyodorov  | 6125594872 |

** Add a constraint to contacts that prevents a duplicate value from being added in the column number

#+BEGIN_SRC sql
  ALTER TABLE contacts
    ADD UNIQUE(NUMBER);
#+END_SRC

#+RESULTS:
| ALTER TABLE |
|-------------|

** Write a SQL statement that attempts to insert a duplicate number for a new contact but fails. What error is shown?


#+BEGIN_SRC sql
  INSERT INTO contacts (first_name, last_name, number)
  VALUES
    ('Bill', 'Smith', '6343511126');
#+END_SRC

#+RESULTS:
|---|
